LukyLuke/STM32F4/inc/lis302dl.h
/**** Macros ****/
// TODO: Create functions from these to be able to use more that only one sensor on different SPI ports
#define LIS302DL_CS_LOW()       GPIO_ResetBits(LIS302DL_SPI_CS_GPIO_PORT, LIS302DL_SPI_CS_PIN)
#define LIS302DL_CS_HIGH()      GPIO_SetBits(LIS302DL_SPI_CS_GPIO_PORT, LIS302DL_SPI_CS_PIN)

/**
 * @brief  Write the configuration to the LIS302DL device
 * @param  spi  Pointer to the SPI on which the data should be sent/set/received
 * @param  pConfig  Pointer to the configuration to write
 * @retval void
 */
void LIS302DL_Init(SPI_TypeDef* spi, const LIS302DL_Config* config);

/**
 * @brief  Read out the configuration form a LIS302DL
 * @param  spi  Pointer to the SPI on which the data should be sent/set/received
 * @param  pConfig  Pointer to write the configuration to
 * @retval void
 */
void LIS302DL_GetConfiguration(SPI_TypeDef* spi, volatile LIS302DL_Config* config);

/**
 * @brief  Read data from a LIS302DL.
 * @param  spi  Pointer to the SPI on which the data should be sent/set/received
 * @param  pBuffer  Pointer to the buffer for the received data
 * @param  readAddr  LIS302DL Internal address from the register to read from
 * @param  numByteToRead  Number of bytes to read from the LIS302DL
 * @retval void
 */
void LIS302DL_Read(SPI_TypeDef* spi, uint8_t* pBuffer, uint8_t readAddr, uint16_t numByteToRead);

/**
 * @brief  Writes one byte to the LIS302DL.
 * @param  spi  Pointer to the SPI on which the data should be sent/set/received
 * @param  pBuffer  Pointer to the buffer  containing the data to be written to the LIS302DL.
 * @param  writeAddr  LIS302DL's internal address to write to.
 * @param  NumByteToWrite  Number of bytes to write.
 * @retval void
 */
void LIS302DL_Write(SPI_TypeDef* spi, uint8_t* pBuffer, uint8_t writeAddr, uint16_t numByteToWrite);

/**
 * @brief  Read the LIS302DL output register and calculate the acceleration based like:
 *         ACC[mg] = SENSITIVITY * (out_h * 256 + out_l) / 16 (12 bit rappresentation)
 * @param  spi  Pointer to the SPI on which the data should be sent/set/received
 * @param out  Pointer to the buffer to store the received data
 * @retval void
 */
void LIS302DL_Acceleration(SPI_TypeDef* spi, int32_t* out);

/**
 * @brief  Rebot the memory content of a LIS302DL device
 *         This is done by setting BOOT in CTRL_REG2
 * @param  spi  Pointer to the SPI on which the data should be sent/set/received
 * @retval None
 */
void LIS302DL_Reboot(SPI_TypeDef* spi);

/**
 * @brief  Change the sensor scale to full/halve scale
 *         In full scale the measurement rate is ±2.3g (default), otherwise it is ±9.2g
 * @param  spi  Pointer to the SPI on which the data should be sent/set/received
 * @param  fullScaleEnable Set to true to change to ±2.3g mode or false if you want ±9.2g
 * @retval None
 */
void LIS302DL_ChangeScaleMode(SPI_TypeDef* spi, uint8_t fullScaleEnable);

/**
 * @brief  Change the sensor data rate to 100Hz or 400Hz
 *         For full speed 400Hz (defalut), set enableHighSpeed to true, otherwise to false
 * @param  spi  Pointer to the SPI on which the data should be sent/set/received
 * @param  enableHighSpeed Enable for 400Hz, disable for 100Hz data rate
 * @retval None
 */
void LIS302D_ChangeDataRate(SPI_TypeDef* spi, uint8_t enableHighSpeed);

/**
 * @brief  Change the sensors PowerDown control
 * @param  spi  Pointer to the SPI on which the data should be sent/set/received
 * @param  enableActiveMode Set to true to enable the sensors active mode, else the sensor is in power down control
 * @retval None
 */
void LIS302D_ChangePowerControl(SPI_TypeDef* spi, uint8_t enableActiveMode);

/**
 * @brief  Configure the global interrupts
 * @param  spi  Pointer to the SPI on which the data should be sent/set/received
 * @param  pConfig  Pointer to an interrupt configuration
 * @retval None
 */
void LIS302DL_GlobalInterruptConfiguration(SPI_TypeDef* spi, LIS302DL_GlobalInterruptConfig* pConfig);

/**
 * @brief  Get the global configuration from the interrupts
 * @param  spi  Pointer to the SPI on which the data should be sent/set/received
 * @param  pConfig  Pointer to an interrupt configuration
 * @retval None
 */
void LIS302DL_GetGlobalInterruptConfiguration(SPI_TypeDef* spi, LIS302DL_GlobalInterruptConfig* pConfig);

/**
 * @brief  Configure the FreeFall/Wakeup interrupts
 * @param  spi  Pointer to the SPI on which the data should be sent/set/received
 * @param  pConfig  Pointer to a wakeup interrupt configuration
 * @param  intNum  Number of the interrupt, can be 1 or 2 (use LIS302DL_INTERRUPT_NUM_*)
 * @retval None
 */
void LIS302DL_WakeupInterruptConfiguration(SPI_TypeDef* spi, LIS302DL_WakeupInterruptConfig* pConfig, uint8_t intNum);

/**
 * @brief  Get the configure from FreeFall/Wakeup interrupts
 * @param  spi  Pointer to the SPI on which the data should be sent/set/received
 * @param  pConfig  Pointer to a wakeup interrupt configuration
 * @param  intNum  Number of the interrupt, can be 1 or 2
 * @retval None
 */
void LIS302DL_GetWakeupInterruptConfiguration(SPI_TypeDef* spi, LIS302DL_WakeupInterruptConfig* pConfig, uint8_t intNum);

/**
 * @brief  Get FreeFall/Wakeup interrupt data
 * @param  spi  Pointer to the SPI on which the data should be sent/set/received
 * @param  pData  Pointer to a wakeup interrupt data storage
 * @param  intNum  Number of the interrupt, can be 1 or 2
 * @retval None
 */
void LIS302DL_GetWakeupInterruptData(SPI_TypeDef* spi, LIS302DL_WakeupInterruptData* pData, uint8_t intNum);

/**
 * @brief  Configure the click interrupts
 * @param  spi  Pointer to the SPI on which the data should be sent/set/received
 * @param  pConfig  Pointer to a click interrupt configuration
 * @retval None
 */
void LIS302DL_ClickInterruptConfiguration(SPI_TypeDef* spi, LIS302DL_ClickInterruptConfig* pConfig);

/**
 * @brief  Get the configure from click interrupts
 * @param  spi  Pointer to the SPI on which the data should be sent/set/received
 * @param  pConfig  Pointer to a click interrupt configuration
 * @retval None
 */
void LIS302DL_GetClickInterruptConfiguration(SPI_TypeDef* spi, LIS302DL_ClickInterruptConfig* pConfig);

/**
 * @brief  Get click interrupt data
 * @param  spi  Pointer to the SPI on which the data should be sent/set/received
 * @param  pData  Pointer to a click interrupt data storage
 * @retval None
 */
void LIS302DL_GetClickInterruptData(SPI_TypeDef* spi, LIS302DL_ClickInterruptData* pData);

#endif // LIS302DL_H